"""
============================================================
  ТЕМА 12: Обработка исключений — Упражнения
============================================================
  Каждое задание содержит подробное описание, примеры
  ожидаемого результата и подсказки.
============================================================
"""

# ============================================================
# Задание 1: Безопасный ввод числа
# ============================================================
# Напишите функцию safe_input(prompt, type_=int), которая
# запрашивает ввод до тех пор, пока пользователь не введёт
# корректное значение указанного типа.
#
# Ожидаемый результат:
#   n = safe_input("Введите число: ")
#   # Введите число: abc
#   # Ошибка! Введите корректное значение типа int.
#   # Введите число: 42
#   print(n)  → 42 (тип int)
#
#   f = safe_input("Введите дробное: ", float)
#   # Введите дробное: 3.14
#   print(f)  → 3.14 (тип float)
#
# Подсказка:
#   while True:
#       try:
#           return type_(input(prompt))
#       except ValueError:
#           print(f"Ошибка! Введите корректное значение типа {type_.__name__}.")

# Ваш код здесь:


# ============================================================
# Задание 2: Безопасное деление
# ============================================================
# Напишите функцию safe_divide(a, b), которая обрабатывает:
#   - ZeroDivisionError → "Деление на ноль!"
#   - TypeError → "Оба аргумента должны быть числами!"
# В случае успеха возвращает результат, иначе None.
#
# Ожидаемый результат:
#   print(safe_divide(10, 3))    → 3.3333333333333335
#   print(safe_divide(10, 0))    → None (+ "Деление на ноль!")
#   print(safe_divide("a", 5))   → None (+ "Оба аргумента...")
#
# Подсказка:
#   try: return a / b
#   except ZeroDivisionError: ...
#   except TypeError: ...

# Ваш код здесь:


# ============================================================
# Задание 3: Безопасный доступ к элементу
# ============================================================
# Напишите функцию safe_get(collection, key, default=None),
# которая безопасно получает элемент из списка/словаря.
# Обрабатывает IndexError, KeyError и TypeError.
#
# Ожидаемый результат:
#   lst = [10, 20, 30]
#   print(safe_get(lst, 1))      → 20
#   print(safe_get(lst, 10))     → None
#   print(safe_get(lst, 10, -1)) → -1
#
#   d = {"a": 1, "b": 2}
#   print(safe_get(d, "a"))      → 1
#   print(safe_get(d, "z"))      → None
#
# Подсказка:
#   try: return collection[key]
#   except (IndexError, KeyError): return default
#   except TypeError: return default

# Ваш код здесь:


# ============================================================
# Задание 4: Безопасное чтение файла
# ============================================================
# Напишите функцию read_file_safe(path), которая:
#   - Возвращает содержимое файла при успехе
#   - Обрабатывает FileNotFoundError, PermissionError,
#     UnicodeDecodeError
#   - Использует блок finally для логирования
#
# Ожидаемый результат:
#   content = read_file_safe("exists.txt")
#   print(content)  → "содержимое файла"
#
#   content = read_file_safe("nope.txt")
#   # "Файл 'nope.txt' не найден!"
#   # "Попытка чтения завершена."  (finally)
#   print(content)  → None
#
# Подсказка:
#   try: ... except FileNotFoundError: ...
#   finally: print("Попытка чтения завершена.")

# Ваш код здесь:


# ============================================================
# Задание 5: Собственное исключение
# ============================================================
# Создайте иерархию исключений:
#   ValidationError(Exception) — базовое
#   AgeError(ValidationError)  — для возраста
#   EmailError(ValidationError) — для email
#
# Функция validate_age(age) → AgeError если age < 0 или > 150.
# Функция validate_email(email) → EmailError если нет "@".
#
# Ожидаемый результат:
#   try:
#       validate_age(-5)
#   except AgeError as e:
#       print(e)  → "Некорректный возраст: -5 (допустимо 0-150)"
#
#   try:
#       validate_email("invalid")
#   except EmailError as e:
#       print(e)  → "Некорректный email: 'invalid' (нет символа @)"
#
# Подсказка:
#   class AgeError(ValidationError):
#       def __init__(self, age):
#           super().__init__(f"Некорректный возраст: {age}")

# Ваш код здесь:


# ============================================================
# Задание 6: Универсальный конвертер
# ============================================================
# Напишите функцию convert(value, to_type), которая пытается
# преобразовать value в to_type. Если не получается —
# возвращает исходное значение и выводит предупреждение.
#
# Ожидаемый результат:
#   print(convert("42", int))      → 42
#   print(convert("3.14", float))  → 3.14
#   print(convert("abc", int))     → "abc" (+ предупреждение)
#   print(convert("true", bool))   → True
#   print(convert([1,2], str))     → "[1, 2]"
#
# Подсказка:
#   try: return to_type(value)
#   except (ValueError, TypeError) as e:
#       print(f"Не удалось преобразовать: {e}")
#       return value

# Ваш код здесь:


# ============================================================
# Задание 7: Класс SafeDict
# ============================================================
# Создайте SafeDict, наследник dict, у которого:
#   - __getitem__ возвращает None вместо KeyError
#   - __setitem__ логирует каждое присваивание
#   - get_or_raise(key) → вызывает KeyError если ключа нет
#
# Ожидаемый результат:
#   sd = SafeDict({"a": 1, "b": 2})
#   print(sd["a"])  → 1
#   print(sd["z"])  → None  (вместо KeyError)
#
#   sd["c"] = 3     # Вывод: "SET: c = 3"
#
#   sd.get_or_raise("z")  # KeyError: 'z'
#
# Подсказка:
#   def __getitem__(self, key):
#       try: return super().__getitem__(key)
#       except KeyError: return None

# Ваш код здесь:


# ============================================================
# Задание 8: Контекстный менеджер с обработкой ошибок
# ============================================================
# Создайте класс DatabaseConnection (имитация), который:
#   - В __enter__ выводит "Подключение открыто"
#   - В __exit__ выводит "Подключение закрыто"
#   - Если внутри with произошла ошибка — логирует её,
#     но НЕ прерывает программу (return True в __exit__)
#
# Ожидаемый результат:
#   with DatabaseConnection("mydb") as db:
#       print("Работаем с БД...")
#       raise ValueError("Ошибка данных!")
#   # Подключение к mydb открыто
#   # Работаем с БД...
#   # ОШИБКА в БД: Ошибка данных!
#   # Подключение к mydb закрыто
#   print("Программа продолжает работу!")  # Не упала!
#
# Подсказка:
#   def __exit__(self, exc_type, exc_val, exc_tb):
#       if exc_type: print(f"ОШИБКА: {exc_val}")
#       print("Подключение закрыто")
#       return True  # подавляет исключение

# Ваш код здесь:


# ============================================================
# Задание 9: Валидатор данных (множественные ошибки)
# ============================================================
# Напишите функцию validate_user(data), которая проверяет
# словарь с полями name, age, email и собирает ВСЕ ошибки
# (не падает на первой). Возвращает список ошибок.
#
# Ожидаемый результат:
#   errors = validate_user({"name": "", "age": -5, "email": "bad"})
#   print(errors)
#   # ["Имя не может быть пустым",
#   #  "Возраст должен быть от 0 до 150",
#   #  "Email должен содержать @"]
#
#   errors = validate_user({"name": "Алиса", "age": 25,
#                           "email": "a@b.ru"})
#   print(errors)  → []  (нет ошибок)
#
# Подсказка: errors = []; if not data.get("name"): errors.append(...)

# Ваш код здесь:


# ============================================================
# Задание 10: Retry-декоратор
# ============================================================
# Напишите декоратор retry(max_attempts=3, delay=1),
# который повторяет вызов функции при возникновении
# исключения. Между попытками — пауза delay секунд.
#
# Ожидаемый результат:
#   @retry(max_attempts=3, delay=0.5)
#   def unstable_function():
#       import random
#       if random.random() < 0.7:
#           raise ConnectionError("Сервер недоступен")
#       return "Успех!"
#
#   result = unstable_function()
#   # Попытка 1/3 не удалась: Сервер недоступен
#   # Попытка 2/3 не удалась: Сервер недоступен
#   # Попытка 3/3: Успех!
#   print(result)  → "Успех!"
#
# Подсказка:
#   import time, functools
#   def retry(max_attempts=3, delay=1):
#       def decorator(func):
#           @functools.wraps(func)
#           def wrapper(*args, **kwargs):
#               for attempt in range(1, max_attempts + 1):
#                   try: return func(*args, **kwargs)
#                   except Exception as e:
#                       if attempt == max_attempts: raise
#                       time.sleep(delay)

import time
import functools

# Ваш код здесь:
