"""
04 — Структуры данных: Практические упражнения

Напишите решения прямо в этом файле.
Запустите для проверки: python exercises.py
"""
from collections import Counter, defaultdict, deque


# ============================================================
# Упражнение 1: Группировка по первой букве
# ============================================================
# Используя defaultdict, сгруппируйте слова по первой букве.
#
# Пример:
#   group_by_first(["apple", "banana", "avocado", "blueberry", "cherry"])
#   → {"a": ["apple", "avocado"], "b": ["banana", "blueberry"], "c": ["cherry"]}

def group_by_first(words):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 2: Top-K частых элементов
# ============================================================
# Найдите K самых частых элементов в списке.
#
# Пример:
#   top_k([1,1,1,2,2,3], k=2) → [1, 2]

def top_k(nums, k):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 3: LRU Cache вручную
# ============================================================
# Реализуйте простой LRU Cache (Least Recently Used) на основе
# OrderedDict с ограничением по размеру.
#
# Пример:
#   cache = LRUCache(2)
#   cache.put("a", 1)
#   cache.put("b", 2)
#   cache.get("a")       → 1
#   cache.put("c", 3)    # вытесняет "b"
#   cache.get("b")       → -1 (не найден)

from collections import OrderedDict

class LRUCache:
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 4: Инвертировать словарь
# ============================================================
# Поменяйте ключи и значения местами.
# Если значения повторяются, группируйте ключи в список.
#
# Пример:
#   invert({"a": 1, "b": 2, "c": 1})
#   → {1: ["a", "c"], 2: ["b"]}

def invert(d):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 5: Скользящее окно с deque
# ============================================================
# Найдите максимум в каждом окне размера k.
#
# Пример:
#   sliding_max([1, 3, -1, -3, 5, 3, 6, 7], k=3) → [3, 3, 5, 5, 6, 7]

def sliding_max(nums, k):
    # Ваш код здесь
    pass


# ============================================================
# Тесты
# ============================================================
if __name__ == "__main__":
    print("=" * 50)
    print("Тестирование упражнений 04_data_structures")
    print("=" * 50)

    # Тест 1
    print("\n--- Упражнение 1: group_by_first ---")
    result = group_by_first(["apple", "banana", "avocado", "blueberry", "cherry"])
    assert result["a"] == ["apple", "avocado"]
    assert result["b"] == ["banana", "blueberry"]
    assert result["c"] == ["cherry"]
    print("✅ Все тесты пройдены!")

    # Тест 2
    print("\n--- Упражнение 2: top_k ---")
    assert top_k([1, 1, 1, 2, 2, 3], k=2) == [1, 2]
    print("✅ Все тесты пройдены!")

    # Тест 4
    print("\n--- Упражнение 4: invert ---")
    result = invert({"a": 1, "b": 2, "c": 1})
    assert result == {1: ["a", "c"], 2: ["b"]}
    print("✅ Все тесты пройдены!")

    # Тест 5
    print("\n--- Упражнение 5: sliding_max ---")
    assert sliding_max([1, 3, -1, -3, 5, 3, 6, 7], k=3) == [3, 3, 5, 5, 6, 7]
    print("✅ Все тесты пройдены!")

    print("\n" + "=" * 50)
    print("🎉 Все упражнения выполнены верно!")
    print("=" * 50)
