"""
02 — Функции и декораторы: Практические упражнения

Напишите решения прямо в этом файле.
Запустите для проверки: python exercises.py
"""
from functools import wraps


# ============================================================
# Упражнение 1: Декоратор таймер
# ============================================================
# Напишите декоратор timer, который замеряет время выполнения
# функции и печатает его.
# Используйте functools.wraps!
#
# Пример:
#   @timer
#   def slow():
#       for _ in range(1000000): pass
#   slow()  → "slow выполнена за 0.0312 сек."

import time

def timer(func):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 2: Декоратор retry
# ============================================================
# Напишите декоратор retry(max_attempts), который повторяет
# вызов функции при возникновении исключения.
#
# Пример:
#   @retry(max_attempts=3)
#   def unstable():
#       import random
#       if random.random() < 0.7:
#           raise ValueError("Ошибка!")
#       return "Успех!"

def retry(max_attempts=3):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 3: Генератор Фибоначчи
# ============================================================
# Напишите генератор fibonacci(n), который выдаёт первые n
# чисел Фибоначчи.
#
# Пример:
#   list(fibonacci(7)) → [0, 1, 1, 2, 3, 5, 8]
#   list(fibonacci(1)) → [0]

def fibonacci(n):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 4: Кэширующий декоратор (мемоизация)
# ============================================================
# Напишите декоратор memoize, который кэширует результаты
# вызовов функции. Если функция вызвана с теми же аргументами —
# верните результат из кэша.
#
# Пример:
#   @memoize
#   def expensive(n):
#       print(f"Вычисляю {n}...")
#       return n ** 2
#   expensive(5)  → печатает "Вычисляю 5..." и возвращает 25
#   expensive(5)  → НЕ печатает, сразу возвращает 25

def memoize(func):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 5: Замыкание — счётчик вызовов
# ============================================================
# Напишите функцию make_counter(), которая возвращает функцию-
# счётчик. Каждый вызов возвращённой функции увеличивает счётчик
# и возвращает текущее значение.
#
# Пример:
#   counter = make_counter()
#   print(counter())  → 1
#   print(counter())  → 2
#   print(counter())  → 3

def make_counter():
    # Ваш код здесь
    pass


# ============================================================
# Тесты
# ============================================================
if __name__ == "__main__":
    print("=" * 50)
    print("Тестирование упражнений 02_functions_and_decorators")
    print("=" * 50)

    # Тест 3
    print("\n--- Упражнение 3: fibonacci ---")
    assert list(fibonacci(7)) == [0, 1, 1, 2, 3, 5, 8]
    assert list(fibonacci(1)) == [0]
    assert list(fibonacci(0)) == []
    print("✅ Все тесты пройдены!")

    # Тест 5
    print("\n--- Упражнение 5: make_counter ---")
    c = make_counter()
    assert c() == 1
    assert c() == 2
    assert c() == 3
    c2 = make_counter()
    assert c2() == 1  # независимый счётчик
    print("✅ Все тесты пройдены!")

    print("\n" + "=" * 50)
    print("🎉 Все упражнения выполнены верно!")
    print("=" * 50)
