"""
============================================================
  ТЕМА 15: Comprehensions — Упражнения
============================================================
  Каждое задание содержит подробное описание, примеры
  ожидаемого результата и подсказки.
============================================================
"""

# ============================================================
# Задание 1: List Comprehension — основы
# ============================================================
# Используя list comprehension, создайте:
# 1. Список квадратов чисел от 1 до 10
# 2. Список чётных чисел от 1 до 20
# 3. Список длин слов в предложении
#
# Ожидаемый результат:
#   squares = [x**2 for x in range(1, 11)]
#   print(squares)  → [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
#
#   evens = ???
#   print(evens)    → [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
#
#   sentence = "Python это мощный язык программирования"
#   lengths = ???
#   print(lengths)  → [6, 3, 6, 4, 16]
#
# Подсказка: [выражение for x in итерируемый if условие]

# Ваш код здесь:


# ============================================================
# Задание 2: List Comprehension — фильтрация
# ============================================================
# Дан список чисел. Используя comprehension, создайте:
# 1. Только положительные числа
# 2. Числа, делящиеся на 3 И на 5
# 3. Числа, у которых более 2 цифр
#
# Ожидаемый результат:
#   nums = [-5, 12, 0, -3, 15, 100, 7, 30, -10, 45, 8, 150]
#
#   positive = ???
#   print(positive)     → [12, 15, 100, 7, 30, 45, 8, 150]
#
#   div_3_and_5 = ???
#   print(div_3_and_5)  → [0, 15, 30, 45, 150]
#
#   big_nums = ???
#   print(big_nums)     → [100, 150]
#
# Подсказка: len(str(abs(x))) > 2 для проверки количества цифр

nums = [-5, 12, 0, -3, 15, 100, 7, 30, -10, 45, 8, 150]

# Ваш код здесь:


# ============================================================
# Задание 3: List Comprehension — трансформация строк
# ============================================================
# Дан список имён. Используя comprehension:
# 1. Переведите все в верхний регистр
# 2. Оставьте только имена длиннее 4 букв, добавив "!"
# 3. Создайте список кортежей (имя, длина)
#
# Ожидаемый результат:
#   names = ["Алиса", "Борис", "Ян", "Екатерина", "Ева", "Максим"]
#
#   upper = ???
#   print(upper)   → ["АЛИСА", "БОРИС", "ЯН", "ЕКАТЕРИНА", "ЕВА", "МАКСИМ"]
#
#   long_names = ???
#   print(long_names) → ["Алиса!", "Борис!", "Екатерина!", "Максим!"]
#
#   name_lens = ???
#   print(name_lens) → [("Алиса",5), ("Борис",5), ("Ян",2),
#                        ("Екатерина",9), ("Ева",3), ("Максим",6)]
#
# Подсказка: [(name, len(name)) for name in names]

names = ["Алиса", "Борис", "Ян", "Екатерина", "Ева", "Максим"]

# Ваш код здесь:


# ============================================================
# Задание 4: Dict Comprehension
# ============================================================
# Используя dict comprehension:
# 1. Создайте словарь {число: квадрат} для чисел 1-10
# 2. Инвертируйте словарь (ключи ↔ значения)
# 3. Отфильтруйте словарь — только пары со значением > 50
#
# Ожидаемый результат:
#   squares = ???
#   print(squares)  → {1:1, 2:4, 3:9, ..., 10:100}
#
#   original = {"a": 1, "b": 2, "c": 3}
#   inverted = ???
#   print(inverted) → {1: "a", 2: "b", 3: "c"}
#
#   prices = {"яблоко": 80, "хлеб": 45, "молоко": 75, "сок": 120}
#   expensive = ???
#   print(expensive) → {"яблоко": 80, "молоко": 75, "сок": 120}
#
# Подсказка: {k: v for k, v in dict.items() if v > 50}

# Ваш код здесь:


# ============================================================
# Задание 5: Set Comprehension
# ============================================================
# Используя set comprehension:
# 1. Множество уникальных длин слов в тексте
# 2. Множество общих букв двух слов
# 3. Множество гласных букв в строке
#
# Ожидаемый результат:
#   text = "Python это простой и мощный язык"
#   word_lengths = ???
#   print(word_lengths)  → {1, 3, 5, 6, 7}  (порядок не важен)
#
#   word1, word2 = "программирование", "информатика"
#   common = ???
#   print(common)  → {'р', 'о', 'а', 'и', 'н', 'м'}
#
#   vowels_in = ???  # гласные: "аеёиоуыэюяАЕЁИОУЫЭЮЯ"
#   print(vowels_in) → {'о', 'о', 'и', 'я', ...}
#
# Подсказка: {len(w) for w in text.split()}

# Ваш код здесь:


# ============================================================
# Задание 6: Вложенные comprehensions
# ============================================================
# 1. Сгенерируйте таблицу умножения 10×10 (список списков)
# 2. Разверните вложенный список (flatten)
# 3. Создайте матрицу NxN с нулями, кроме диагонали (единицы)
#
# Ожидаемый результат:
#   table = ???
#   print(table[2][3])  → 12  (3 * 4)
#   print(table[0])     → [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#
#   nested = [[1, 2], [3, 4], [5, 6]]
#   flat = ???
#   print(flat)  → [1, 2, 3, 4, 5, 6]
#
#   identity = ???  # n = 4
#   # [[1, 0, 0, 0],
#   #  [0, 1, 0, 0],
#   #  [0, 0, 1, 0],
#   #  [0, 0, 0, 1]]
#
# Подсказка:
#   table = [[(i+1)*(j+1) for j in range(10)] for i in range(10)]
#   flat = [x for sublist in nested for x in sublist]
#   identity = [[1 if i==j else 0 for j in range(n)] for i in range(n)]

# Ваш код здесь:


# ============================================================
# Задание 7: Comprehension с функциями
# ============================================================
# 1. Примените функцию ко всем элементам списка
# 2. Создайте список функций (фабрика)
# 3. Отфильтруйте с помощью пользовательской функции
#
# Ожидаемый результат:
#   def celsius_to_fahr(c): return c * 9/5 + 32
#   temps_c = [0, 20, 37, 100]
#   temps_f = ???
#   print(temps_f)  → [32.0, 68.0, 98.6, 212.0]
#
#   # Фабрика множителей:
#   multipliers = [lambda x, n=n: x * n for n in range(1, 6)]
#   print([m(10) for m in multipliers])  → [10, 20, 30, 40, 50]
#
#   def is_palindrome(s): return s == s[::-1]
#   words = ["шалаш", "дом", "топот", "кот", "казак"]
#   palindromes = ???
#   print(palindromes)  → ["шалаш", "топот", "казак"]
#
# Подсказка: [func(x) for x in items]

# Ваш код здесь:


# ============================================================
# Задание 8: Walrus operator в comprehensions (:=)
# ============================================================
# Используя walrus operator (Python 3.8+):
# 1. Отфильтруйте и сохраните результат вычисления
# 2. Найдите слова, чьи длины > среднего
#
# Ожидаемый результат:
#   numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
#   # Квадраты, которые больше 20:
#   result = [(x, sq) for x in numbers if (sq := x**2) > 20]
#   print(result)  → [(5, 25), (6, 36), (7, 49), (8, 64), (9, 81), (10, 100)]
#
#   words = ["кот", "программирование", "дом", "алгоритм", "мяч"]
#   avg_len = sum(len(w) for w in words) / len(words)
#   long = [w for w in words if (n := len(w)) > avg_len]
#   print(long)     → ["программирование", "алгоритм"]
#   print(avg_len)  → 5.8
#
# Подсказка: walrus operator := присваивает и возвращает значение

# Ваш код здесь:


# ============================================================
# Задание 9: Обработка данных с comprehensions
# ============================================================
# Дан список словарей (студенты). Используя comprehensions:
# 1. Извлеките имена отличников (средний балл >= 4.5)
# 2. Создайте словарь {имя: средний_балл}
# 3. Найдите максимальный средний балл
#
# Ожидаемый результат:
#   students = [
#       {"name": "Алиса", "grades": [5, 5, 4, 5]},
#       {"name": "Борис", "grades": [3, 4, 3, 4]},
#       {"name": "Вика",  "grades": [5, 5, 5, 5]},
#       {"name": "Глеб",  "grades": [4, 4, 5, 4]},
#   ]
#
#   excellent = ???
#   print(excellent)  → ["Алиса", "Вика"]
#
#   avg_grades = ???
#   print(avg_grades) → {"Алиса": 4.75, "Борис": 3.5,
#                         "Вика": 5.0, "Глеб": 4.25}
#
#   best = max(avg_grades, key=avg_grades.get)
#   print(best)  → "Вика"
#
# Подсказка: sum(s["grades"]) / len(s["grades"])

students = [
    {"name": "Алиса", "grades": [5, 5, 4, 5]},
    {"name": "Борис", "grades": [3, 4, 3, 4]},
    {"name": "Вика",  "grades": [5, 5, 5, 5]},
    {"name": "Глеб",  "grades": [4, 4, 5, 4]},
]

# Ваш код здесь:


# ============================================================
# Задание 10: Генераторные выражения
# ============================================================
# Замените list comprehension на генераторные выражения
# для экономии памяти. Вычислите:
# 1. Сумму квадратов чисел от 1 до 1_000_000
# 2. Максимальную длину строки в списке
# 3. Проверьте: все ли числа положительные (all)
# 4. Проверьте: есть ли хотя бы одно чётное (any)
#
# Ожидаемый результат:
#   total = sum(x**2 for x in range(1, 1_000_001))
#   print(total)  → 333333833333500000
#
#   words = ["Python", "программирование", "код", "алгоритм"]
#   max_len = max(len(w) for w in words)
#   print(max_len)  → 16
#
#   nums = [1, 5, 3, 8, 2]
#   print(all(x > 0 for x in nums))   → True
#   print(any(x % 2 == 0 for x in nums)) → True
#
# Подсказка: генераторное выражение = круглые скобки вместо []
#   sum(x**2 for x in range(...))  # НЕ sum([x**2 ...])

# Ваш код здесь:
