"""
============================================================
  ТЕМА 14: Декораторы и генераторы — Упражнения
============================================================
  Каждое задание содержит подробное описание, примеры
  ожидаемого результата и подсказки.
============================================================
"""

# ============================================================
# Задание 1: Декоратор логирования
# ============================================================
# Напишите декоратор @log, который выводит имя функции,
# аргументы и результат при каждом вызове.
#
# Ожидаемый результат:
#   @log
#   def add(a, b):
#       return a + b
#
#   add(3, 5)
#   # ВЫЗОВ: add(3, 5)
#   # РЕЗУЛЬТАТ: add → 8
#   # Возвращает: 8
#
# Подсказка:
#   import functools
#   def log(func):
#       @functools.wraps(func)
#       def wrapper(*args, **kwargs):
#           print(f"ВЫЗОВ: {func.__name__}({args}, {kwargs})")
#           result = func(*args, **kwargs)
#           print(f"РЕЗУЛЬТАТ: {func.__name__} → {result}")
#           return result
#       return wrapper

import functools
import time

# Ваш код здесь:


# ============================================================
# Задание 2: Декоратор таймер
# ============================================================
# Напишите декоратор @timer, который измеряет время
# выполнения функции в секундах.
#
# Ожидаемый результат:
#   @timer
#   def slow_sum(n):
#       return sum(range(n))
#
#   slow_sum(10_000_000)
#   # Функция 'slow_sum' выполнена за 0.3412 сек.
#   # Возвращает: 49999995000000
#
# Подсказка:
#   start = time.perf_counter()
#   result = func(*args, **kwargs)
#   elapsed = time.perf_counter() - start

# Ваш код здесь:


# ============================================================
# Задание 3: Декоратор кэширования (мемоизация)
# ============================================================
# Напишите декоратор @cache, который кэширует результаты
# вызовов функции. При повторном вызове с теми же аргументами
# возвращает сохранённый результат.
#
# Ожидаемый результат:
#   @cache
#   def fibonacci(n):
#       if n < 2: return n
#       return fibonacci(n-1) + fibonacci(n-2)
#
#   print(fibonacci(50))  → 12586269025  (мгновенно!)
#   # Без кэша fibonacci(50) считался бы часами.
#
# Подсказка:
#   def cache(func):
#       _cache = {}
#       def wrapper(*args):
#           if args not in _cache:
#               _cache[args] = func(*args)
#           return _cache[args]

# Ваш код здесь:


# ============================================================
# Задание 4: Декоратор с параметрами
# ============================================================
# Напишите декоратор @repeat(n), который вызывает
# функцию n раз и возвращает список результатов.
#
# Ожидаемый результат:
#   @repeat(3)
#   def greet(name):
#       return f"Привет, {name}!"
#
#   results = greet("Алиса")
#   print(results)
#   → ["Привет, Алиса!", "Привет, Алиса!", "Привет, Алиса!"]
#
#   @repeat(5)
#   def roll():
#       import random
#       return random.randint(1, 6)
#
#   print(roll())  → [3, 1, 6, 2, 4]
#
# Подсказка:
#   def repeat(n):
#       def decorator(func):
#           def wrapper(*args, **kwargs):
#               return [func(*args, **kwargs) for _ in range(n)]
#           return wrapper
#       return decorator

# Ваш код здесь:


# ============================================================
# Задание 5: Декоратор валидации типов
# ============================================================
# Напишите декоратор @validate_types(*types), который
# проверяет типы аргументов функции.
#
# Ожидаемый результат:
#   @validate_types(int, int)
#   def add(a, b):
#       return a + b
#
#   print(add(3, 5))       → 8
#   print(add("3", 5))     → TypeError: Аргумент 1: ожидался
#                              int, получен str
#
# Подсказка:
#   def validate_types(*types):
#       def decorator(func):
#           def wrapper(*args, **kwargs):
#               for i, (arg, t) in enumerate(zip(args, types)):
#                   if not isinstance(arg, t):
#                       raise TypeError(...)

# Ваш код здесь:


# ============================================================
# Задание 6: Простой генератор — чётные числа
# ============================================================
# Напишите генератор even_numbers(start, end), который
# выдаёт (yield) чётные числа в диапазоне [start, end].
#
# Ожидаемый результат:
#   list(even_numbers(1, 10))   → [2, 4, 6, 8, 10]
#   list(even_numbers(5, 15))   → [6, 8, 10, 12, 14]
#
#   for n in even_numbers(1, 6):
#       print(n, end=" ")  → 2 4 6
#
# Подсказка:
#   def even_numbers(start, end):
#       for n in range(start, end + 1):
#           if n % 2 == 0:
#               yield n

# Ваш код здесь:


# ============================================================
# Задание 7: Генератор Фибоначчи (бесконечный)
# ============================================================
# Напишите бесконечный генератор fibonacci(), который
# выдаёт числа Фибоначчи одно за другим.
# Используйте islice() для получения первых N чисел.
#
# Ожидаемый результат:
#   from itertools import islice
#   fib = fibonacci()
#   print(list(islice(fib, 10)))
#   → [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
#
#   # Можно брать по одному:
#   gen = fibonacci()
#   print(next(gen))  → 0
#   print(next(gen))  → 1
#   print(next(gen))  → 1
#
# Подсказка:
#   def fibonacci():
#       a, b = 0, 1
#       while True:
#           yield a
#           a, b = b, a + b

from itertools import islice

# Ваш код здесь:


# ============================================================
# Задание 8: Генератор — чтение файла по частям
# ============================================================
# Напишите генератор read_chunks(path, chunk_size=1024),
# который читает файл порциями по chunk_size байт.
# Это экономит память при чтении больших файлов.
#
# Ожидаемый результат:
#   for chunk in read_chunks("big_file.txt", 100):
#       print(f"Прочитано {len(chunk)} байт")
#   # Прочитано 100 байт
#   # Прочитано 100 байт
#   # Прочитано 43 байт  (последний кусок)
#
# Подсказка:
#   def read_chunks(path, chunk_size=1024):
#       with open(path, "r", encoding="utf-8") as f:
#           while True:
#               chunk = f.read(chunk_size)
#               if not chunk: break
#               yield chunk

# Ваш код здесь:


# ============================================================
# Задание 9: Генераторное выражение vs list comprehension
# ============================================================
# Сравните потребление памяти и скорость:
# 1. Создайте список квадратов [x**2 for x in range(1_000_000)]
# 2. Создайте генератор квадратов (x**2 for x in range(1_000_000))
# 3. Вычислите сумму обоих и сравните время (используя time)
#
# Ожидаемый результат:
#   import sys
#   lst = [x**2 for x in range(1_000_000)]
#   gen = (x**2 for x in range(1_000_000))
#   print(f"Список: {sys.getsizeof(lst)} байт")  → ~8 МБ
#   print(f"Генератор: {sys.getsizeof(gen)} байт") → ~200 байт
#
#   # Время суммирования обоих примерно одинаково,
#   # но генератор экономит память!
#
# Подсказка: sys.getsizeof() показывает размер объекта в байтах

import sys

# Ваш код здесь:


# ============================================================
# Задание 10: Конвейер генераторов (Pipeline)
# ============================================================
# Создайте конвейер из генераторов для обработки данных:
# 1. generate_numbers(n) — генерирует числа от 1 до n
# 2. filter_odd(gen) — пропускает только нечётные
# 3. square(gen) — возводит в квадрат
# 4. limit(gen, max_val) — пропускает только < max_val
#
# Ожидаемый результат:
#   pipeline = limit(square(filter_odd(generate_numbers(20))), 200)
#   print(list(pipeline))
#   → [1, 9, 25, 49, 81, 121, 169]
#   # 1² 3² 5² 7² 9² 11² 13² (15²=225 > 200, остановка)
#
# Подсказка:
#   def filter_odd(gen):
#       for x in gen:
#           if x % 2 != 0:
#               yield x

# Ваш код здесь:
