"""
============================================================
  ТЕМА 9: Работа с файлами — Упражнения
============================================================
  Каждое задание содержит подробное описание, примеры
  ожидаемого результата и подсказки.
============================================================
"""

# ============================================================
# Задание 1: Запись и чтение текстового файла
# ============================================================
# Создайте файл "hello.txt" и запишите в него 5 строк:
#   "Привет, мир!", "Python — это здорово!",
#   "Файлы — это просто.", "Строка 4", "Строка 5".
# Затем откройте файл и выведите его содержимое.
#
# Ожидаемый результат:
#   Привет, мир!
#   Python — это здорово!
#   Файлы — это просто.
#   Строка 4
#   Строка 5
#
# Подсказка:
#   with open("hello.txt", "w", encoding="utf-8") as f:
#       f.write("текст\n")
#   with open("hello.txt", "r", encoding="utf-8") as f:
#       print(f.read())

# Ваш код здесь:


# ============================================================
# Задание 2: Подсчёт строк, слов и символов
# ============================================================
# Напишите функцию file_stats(path), которая принимает путь
# к файлу и возвращает словарь с количеством строк, слов
# и символов (без учёта переносов строк).
#
# Ожидаемый результат (для файла из задания 1):
#   file_stats("hello.txt")
#   → {"lines": 5, "words": 10, "chars": 75}
#
# Подсказка:
#   lines = f.readlines()
#   words = sum(len(line.split()) for line in lines)
#   chars = sum(len(line.strip()) for line in lines)

# Ваш код здесь:


# ============================================================
# Задание 3: Копирование файла вручную
# ============================================================
# Напишите функцию copy_file(src, dst), которая копирует
# содержимое файла src в файл dst без использования shutil.
# Функция должна вернуть количество скопированных байт.
#
# Ожидаемый результат:
#   copy_file("hello.txt", "hello_copy.txt") → 80
#   # файл hello_copy.txt создан с тем же содержимым
#
# Подсказка:
#   content = f_in.read()
#   f_out.write(content)
#   return len(content.encode("utf-8"))

# Ваш код здесь:


# ============================================================
# Задание 4: Поиск слова в файле
# ============================================================
# Напишите функцию search_in_file(path, word), которая ищет
# слово в файле и возвращает список кортежей (номер_строки, строка)
# для каждого совпадения (регистронезависимый поиск).
#
# Ожидаемый результат:
#   search_in_file("hello.txt", "привет")
#   → [(1, "Привет, мир!")]
#
#   search_in_file("hello.txt", "строка")
#   → [(4, "Строка 4"), (5, "Строка 5")]
#
# Подсказка:
#   for i, line in enumerate(f, 1):
#       if word.lower() in line.lower():

# Ваш код здесь:


# ============================================================
# Задание 5: Журнал (логирование)
# ============================================================
# Напишите функцию log(message, filename="log.txt"), которая
# добавляет сообщение с текущей датой и временем в файл.
# Формат: "[2025-05-07 14:30:00] Сообщение"
#
# Ожидаемый результат после нескольких вызовов:
#   log("Программа запущена")
#   log("Данные загружены")
#   log("Программа завершена")
#
# Содержимое log.txt:
#   [2025-05-07 14:30:00] Программа запущена
#   [2025-05-07 14:30:01] Данные загружены
#   [2025-05-07 14:30:02] Программа завершена
#
# Подсказка:
#   from datetime import datetime
#   timestamp = datetime.now().strftime("%Y-%m-%d %H:%M:%S")
#   Используйте режим "a" (append) для записи.

from datetime import datetime

# Ваш код здесь:


# ============================================================
# Задание 6: JSON — сохранение и загрузка
# ============================================================
# Создайте список студентов (каждый — словарь с ключами
# name, age, grades). Напишите две функции:
#   save_students(students, path) — сохраняет в JSON
#   load_students(path) — загружает из JSON и возвращает список
#
# Ожидаемый результат:
#   students = [
#       {"name": "Алиса", "age": 20, "grades": [5, 4, 5]},
#       {"name": "Борис", "age": 22, "grades": [3, 4, 4]},
#       {"name": "Вика",  "age": 21, "grades": [5, 5, 5]},
#   ]
#   save_students(students, "students.json")
#   loaded = load_students("students.json")
#   print(loaded[0]["name"])  → "Алиса"
#
# Подсказка:
#   import json
#   json.dump(data, f, ensure_ascii=False, indent=2)
#   data = json.load(f)

import json

# Ваш код здесь:


# ============================================================
# Задание 7: CSV — таблица оценок
# ============================================================
# Создайте CSV-файл "grades.csv" с колонками:
#   Имя, Математика, Физика, Информатика
# Заполните 5 студентами. Затем прочитайте файл
# и вычислите средний балл каждого студента.
#
# Ожидаемый результат:
#   Алиса: средний балл 4.67
#   Борис: средний балл 3.67
#   Вика: средний балл 5.00
#   ...
#
# Подсказка:
#   import csv
#   writer = csv.writer(f)
#   writer.writerow(["Имя", "Математика", "Физика", "Информатика"])
#   reader = csv.DictReader(f)  # удобнее чем csv.reader

import csv

# Ваш код здесь:


# ============================================================
# Задание 8: Реверс файла
# ============================================================
# Напишите функцию reverse_file(input_path, output_path),
# которая читает файл и записывает его строки в обратном
# порядке в новый файл. Верните количество строк.
#
# Ожидаемый результат:
#   Исходный файл:         Результат:
#   Строка 1               Строка 3
#   Строка 2               Строка 2
#   Строка 3               Строка 1
#
#   reverse_file("input.txt", "reversed.txt") → 3
#
# Подсказка:
#   lines = f.readlines()
#   reversed_lines = lines[::-1]

# Ваш код здесь:


# ============================================================
# Задание 9: Обозреватель директории
# ============================================================
# Напишите функцию list_py_files(directory="."), которая
# возвращает список словарей с информацией о всех .py файлах:
#   {"name": "script.py", "size_kb": 2.5, "lines": 80}
#
# Ожидаемый результат:
#   list_py_files(".")
#   → [
#       {"name": "exercises.py", "size_kb": 4.2, "lines": 150},
#       {"name": "main.py", "size_kb": 1.1, "lines": 35},
#   ]
#
# Подсказка:
#   from pathlib import Path
#   for p in Path(directory).glob("*.py"):
#       size_kb = p.stat().st_size / 1024
#       lines = len(p.read_text(encoding="utf-8").splitlines())

from pathlib import Path

# Ваш код здесь:


# ============================================================
# Задание 10: Менеджер заметок
# ============================================================
# Реализуйте класс NoteManager, который хранит заметки
# в JSON-файле. Методы:
#   add(text) — добавляет заметку с текущей датой и id
#   show_all() — выводит все заметки красиво
#   delete(note_id) — удаляет заметку по id
#   search(query) — ищет заметки по тексту
#
# Ожидаемый результат:
#   nm = NoteManager("notes.json")
#   nm.add("Купить молоко")
#   nm.add("Сделать домашку по Python")
#   nm.show_all()
#   # Вывод:
#   # [1] 2025-05-07 — Купить молоко
#   # [2] 2025-05-07 — Сделать домашку по Python
#
#   nm.delete(1)
#   nm.show_all()
#   # [2] 2025-05-07 — Сделать домашку по Python
#
# Подсказка:
#   Храните заметки как список словарей:
#   {"id": 1, "date": "2025-05-07", "text": "..."}
#   При каждом изменении перезаписывайте JSON-файл.

# Ваш код здесь:
