"""
============================================================
  ТЕМА 1: Переменные и типы данных — Упражнения
============================================================
"""

# ============================================================
# Задание 1: Создание переменных
# ============================================================
# Создайте переменные:
#   - name (ваше имя, строка)
#   - age (ваш возраст, целое число)
#   - height (ваш рост в метрах, float)
#   - is_student (учитесь ли вы, bool)
# Выведите все переменные с помощью print()

# Ваш код здесь:


# ============================================================
# Задание 2: Определение типов
# ============================================================
# Определите тип каждой переменной ниже с помощью type()
# и выведите результат

a = 42
b = 3.14
c = "Python"
d = True
e = None

# Ваш код здесь:


# ============================================================
# Задание 3: Преобразование типов
# ============================================================
# Дана строка num_str = "123"
# Преобразуйте её в int и float, выведите результаты
# и их типы

num_str = "123"

# Ваш код здесь:


# ============================================================
# Задание 4: Калькулятор
# ============================================================
# Запросите у пользователя два числа (через input)
# Выведите результат их сложения, вычитания,
# умножения и деления
# Подсказка: input() возвращает строку!

# Ваш код здесь:


# ============================================================
# Задание 5: Обмен значений
# ============================================================
# Даны две переменные:
#   x = 10
#   y = 20
# Поменяйте их значения местами БЕЗ использования
# третьей переменной. Выведите результат.

x = 10
y = 20

# Ваш код здесь:


# ============================================================
# Задание 6: Площадь круга
# ============================================================
# Запросите у пользователя радиус круга.
# Вычислите площадь круга по формуле: S = π * r²
# Используйте π = 3.14159
# Выведите результат с пояснением

# Ваш код здесь:


# ============================================================
# Задание 7: Конвертер температуры
# ============================================================
# Запросите у пользователя температуру в Цельсиях.
# Переведите в Фаренгейты: F = C * 9/5 + 32
# Выведите результат в формате:
# "25°C = 77.0°F"

# Ваш код здесь:


# ============================================================
# Задание 8: Разделение числа
# ============================================================
# Дано трёхзначное число (например, 456).
# Разделите его на отдельные цифры и выведите:
# Сотни: 4
# Десятки: 5
# Единицы: 6
# Используйте операторы // и %

number = 456

# Ваш код здесь:


# ============================================================
# Задание 9: Информация о себе (f-строки)
# ============================================================
# Создайте переменные: имя, возраст, город, хобби
# Выведите красиво оформленную информацию,
# используя f-строки. Пример:
# "Меня зовут Алиса, мне 25 лет.
#  Я живу в городе Москва.
#  Моё хобби: программирование."

# Ваш код здесь:


# ============================================================
# Задание 10: Проверка на чётность
# ============================================================
# Запросите у пользователя целое число.
# Определите, чётное оно или нечётное.
# Используйте оператор % (остаток от деления).
# Выведите результат в виде bool:
# "Число 7 чётное? False"
# Подсказка: число чётное, если num % 2 == 0

# Ваш код здесь:
