"""
============================================================
  ТЕМА 8: Функции — Упражнения
============================================================
  Каждое задание содержит подробное описание, примеры
  ожидаемого результата и подсказки.
============================================================
"""

# ============================================================
# Задание 1: Приветствие с аргументами по умолчанию
# ============================================================
# Напишите функцию greet(name, time="утро"), которая возвращает
# строку приветствия. Добавьте аннотации типов.
#
# Ожидаемый результат:
#   print(greet("Алиса"))           → "Доброе утро, Алиса!"
#   print(greet("Борис", "вечер"))  → "Добрый вечер, Борис!"
#
# Подсказка: def greet(name: str, time: str = "утро") -> str:

# Ваш код здесь:


# ============================================================
# Задание 2: Сумма произвольного количества чисел (*args)
# ============================================================
# Напишите функцию sum_numbers(*args), которая принимает
# любое количество чисел и возвращает их сумму.
# Добавьте docstring.
#
# Ожидаемый результат:
#   sum_numbers()           → 0
#   sum_numbers(5)          → 5
#   sum_numbers(1, 2, 3, 4) → 10
#
# Подсказка: args внутри функции — это кортеж. Можно использовать sum().

# Ваш код здесь:


# ============================================================
# Задание 3: Информация о пользователе (**kwargs)
# ============================================================
# Напишите функцию print_user_info(name, **kwargs),
# которая красиво выводит информацию о пользователе.
#
# Ожидаемый результат вызова:
#   print_user_info("Иван", age=30, city="Москва", job="Developer")
#
# Вывод:
#   Имя: Иван
#   Дополнительная информация:
#   - age: 30
#   - city: Москва
#   - job: Developer
#
# Подсказка: kwargs — это словарь. Используйте for k, v in kwargs.items().

# Ваш код здесь:


# ============================================================
# Задание 4: Рекурсивный факториал и числа Фибоначчи
# ============================================================
# 1. Напишите рекурсивную функцию factorial(n)
# 2. Напишите рекурсивную функцию fibonacci(n), возвращающую n-е число.
#    (F0=0, F1=1, Fn=Fn-1+Fn-2)
#
# Ожидаемый результат:
#   factorial(5)  → 120
#   fibonacci(6)  → 8  (0, 1, 1, 2, 3, 5, 8)
#
# Подсказка: обязательно укажите базовый случай (n == 0 / n == 1),
#   иначе будет RecursionError.

# Ваш код здесь:


# ============================================================
# Задание 5: Декоратор времени выполнения
# ============================================================
# Напишите декоратор timer, который измеряет время
# выполнения функции и выводит его.
# Примените декоратор к функции heavy_task().
#
# Ожидаемый результат вызова:
#   heavy_task()
#
# Вывод:
#   Функция 'heavy_task' выполнена за 1.0023 сек.
#
# Подсказка:
#   import time
#   def timer(func):
#       def wrapper(*args, **kwargs):
#           start = time.perf_counter()
#           ...

import time

# Ваш код здесь:

@timer
def heavy_task():
    time.sleep(1) # Имитация долгой работы

# heavy_task()


# ============================================================
# Задание 6: Замыкание (Closure) — Счётчик
# ============================================================
# Напишите функцию make_counter(), которая возвращает
# другую функцию (замыкание). Возвращаемая функция
# при каждом вызове должна увеличивать свой внутренний
# счётчик на 1 и возвращать его.
#
# Ожидаемый результат:
#   counter = make_counter()
#   counter() → 1
#   counter() → 2
#   counter2 = make_counter()
#   counter2() → 1
#
# Подсказка: используйте ключевое слово nonlocal.

# Ваш код здесь:


# ============================================================
# Задание 7: Анонимные функции (lambda)
# ============================================================
# Используя filter() и lambda, отберите из списка строк
# только те, что длиннее 5 символов.
# Затем используя map() и lambda, переведите их в верхний регистр.
#
# Ожидаемый результат:
#   Исходный: ["кот", "программирование", "дом", "алгоритм"]
#   Результат: ['ПРОГРАММИРОВАНИЕ', 'АЛГОРИТМ']
#
# Подсказка: list(filter(lambda x: ..., words))

words = ["кот", "программирование", "дом", "алгоритм", "мяч", "словарь"]

# Ваш код здесь:


# ============================================================
# Задание 8: Генератор паролей
# ============================================================
# Напишите функцию generate_password(length=12),
# которая генерирует случайный пароль из:
# - Строчных и заглавных букв
# - Цифр
# - Спецсимволов
# Гарантируйте, что каждый тип символов присутствует.
#
# Подсказка: используйте модуль string и random.
#   import string, random
#   chars = string.ascii_letters + string.digits + string.punctuation

import random
import string

# Ваш код здесь:


# ============================================================
# Задание 9: Калькулятор (Higher-Order Functions)
# ============================================================
# Создайте 4 функции: add, sub, mul, div.
# Создайте функцию calculate(a, b, operation_func),
# которая принимает два числа и ФУНКЦИЮ операции,
# и возвращает результат.
#
# Ожидаемый результат:
#   calculate(10, 5, add) → 15
#   calculate(10, 5, div) → 2.0
#   calculate(10, 5, lambda x, y: x ** y) → 100000

# Ваш код здесь:


# ============================================================
# Задание 10: Генератор (Generator function)
# ============================================================
# Напишите функцию-генератор fib_gen(n),
# которая возвращает (yield) первые n чисел Фибоначчи.
# Соберите результат в список.
#
# Ожидаемый результат:
#   list(fib_gen(10)) → [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
#
# Подсказка: вместо return a используйте yield a.

# Ваш код здесь:
