"""
01 — Основы и устройство Python: Практические упражнения

Напишите решения прямо в этом файле.
Запустите для проверки: python exercises.py
"""


# ============================================================
# Упражнение 1: Безопасное создание списка
# ============================================================
# Напишите функцию, которая принимает элемент и необязательный список.
# Если список не передан — создаёт новый.
# Избегайте ловушки с мутабельным аргументом по умолчанию!
#
# Пример:
#   safe_append(1)        → [1]
#   safe_append(2)        → [2]  (а не [1, 2]!)
#   safe_append(3, [10])  → [10, 3]

def safe_append(element, lst=None):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 2: Глубокое сравнение
# ============================================================
# Напишите функцию, которая проверяет, являются ли два объекта:
# 1. Равными по значению (==)
# 2. Одним и тем же объектом (is)
# Верните словарь с результатами.
#
# Пример:
#   compare([1,2], [1,2]) → {"equal": True, "identical": False}
#   a = [1]; compare(a, a) → {"equal": True, "identical": True}

def compare(obj1, obj2):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 3: Определение типа копии
# ============================================================
# Напишите функцию, которая принимает вложенный список
# и возвращает его deep copy (используя только стандартную библиотеку).
#
# Пример:
#   original = [[1, 2], [3, 4]]
#   copied = deep_copy_list(original)
#   original[0].append(99)
#   print(copied)  → [[1, 2], [3, 4]]  (не изменился!)

def deep_copy_list(nested_list):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 4: Подсчёт типов
# ============================================================
# Напишите функцию, которая принимает список разных объектов
# и возвращает словарь {тип: количество}.
#
# Пример:
#   count_types([1, "hello", 2, 3.14, "world", True])
#   → {int: 2, str: 2, float: 1, bool: 1}
#
# Подсказка: помните, что bool — подкласс int!
# True и False должны считаться как bool, а не int.

def count_types(items):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 5: Flatten (развернуть вложенный список)
# ============================================================
# Напишите функцию, которая «разворачивает» вложенный список
# любой глубины в плоский список.
#
# Пример:
#   flatten([1, [2, 3], [4, [5, 6]]]) → [1, 2, 3, 4, 5, 6]
#   flatten([[1], [[2]], [[[3]]]]) → [1, 2, 3]
#   flatten([]) → []

def flatten(nested):
    # Ваш код здесь
    pass


# ============================================================
# Тесты (запустите файл для проверки)
# ============================================================
if __name__ == "__main__":
    print("=" * 50)
    print("Тестирование упражнений 01_python_core")
    print("=" * 50)

    # Тест 1
    print("\n--- Упражнение 1: safe_append ---")
    r1 = safe_append(1)
    r2 = safe_append(2)
    r3 = safe_append(3, [10])
    assert r1 == [1], f"Ожидалось [1], получено {r1}"
    assert r2 == [2], f"Ожидалось [2], получено {r2}"
    assert r3 == [10, 3], f"Ожидалось [10, 3], получено {r3}"
    print("✅ Все тесты пройдены!")

    # Тест 2
    print("\n--- Упражнение 2: compare ---")
    assert compare([1, 2], [1, 2]) == {"equal": True, "identical": False}
    a = [1, 2]
    assert compare(a, a) == {"equal": True, "identical": True}
    assert compare(1, 2) == {"equal": False, "identical": False}
    print("✅ Все тесты пройдены!")

    # Тест 3
    print("\n--- Упражнение 3: deep_copy_list ---")
    original = [[1, 2], [3, 4]]
    copied = deep_copy_list(original)
    original[0].append(99)
    assert copied == [[1, 2], [3, 4]], f"Deep copy изменился: {copied}"
    print("✅ Все тесты пройдены!")

    # Тест 4
    print("\n--- Упражнение 4: count_types ---")
    result = count_types([1, "hello", 2, 3.14, "world", True])
    assert result[bool] == 1, f"bool: ожидалось 1, получено {result.get(bool)}"
    assert result[int] == 2, f"int: ожидалось 2, получено {result.get(int)}"
    assert result[str] == 2, f"str: ожидалось 2, получено {result.get(str)}"
    assert result[float] == 1, f"float: ожидалось 1, получено {result.get(float)}"
    print("✅ Все тесты пройдены!")

    # Тест 5
    print("\n--- Упражнение 5: flatten ---")
    assert flatten([1, [2, 3], [4, [5, 6]]]) == [1, 2, 3, 4, 5, 6]
    assert flatten([[1], [[2]], [[[3]]]]) == [1, 2, 3]
    assert flatten([]) == []
    assert flatten([1, 2, 3]) == [1, 2, 3]
    print("✅ Все тесты пройдены!")

    print("\n" + "=" * 50)
    print("🎉 Все упражнения выполнены верно!")
    print("=" * 50)
