"""
============================================================
  ТЕМА 16: Регулярные выражения — Упражнения
============================================================
  Каждое задание содержит подробное описание, примеры
  ожидаемого результата и подсказки.
============================================================
"""
import re

# ============================================================
# Задание 1: Поиск email-адресов
# ============================================================
# Напишите функцию find_emails(text), которая находит
# все email-адреса в тексте и возвращает список.
#
# Ожидаемый результат:
#   text = "Пишите на info@mail.ru или admin@site.com, а не на 123"
#   print(find_emails(text))
#   → ["info@mail.ru", "admin@site.com"]
#
# Подсказка: паттерн r"[\w.-]+@[\w.-]+\.\w+"

# Ваш код здесь:


# ============================================================
# Задание 2: Поиск телефонных номеров
# ============================================================
# Напишите функцию find_phones(text), которая находит
# телефоны в форматах: +7(999)123-45-67, 8-999-123-4567,
# +79991234567, 8 999 123 45 67.
#
# Ожидаемый результат:
#   text = "Звоните: +7(999)123-45-67 или 8-800-555-35-35"
#   print(find_phones(text))
#   → ["+7(999)123-45-67", "8-800-555-35-35"]
#
# Подсказка: r"[+]?[78][\s(-]*\d{3}[\s)-]*\d{3}[\s-]*\d{2}[\s-]*\d{2}"

# Ваш код здесь:


# ============================================================
# Задание 3: Валидация пароля
# ============================================================
# Напишите функцию validate_password(password), которая
# проверяет, что пароль содержит:
#   - Минимум 8 символов
#   - Хотя бы одну заглавную букву
#   - Хотя бы одну строчную букву
#   - Хотя бы одну цифру
#   - Хотя бы один спецсимвол (!@#$%^&*)
# Возвращает (True/False, список_ошибок).
#
# Ожидаемый результат:
#   print(validate_password("Abc123!@"))   → (True, [])
#   print(validate_password("abc"))
#   → (False, ["Минимум 8 символов", "Нужна заглавная буква",
#              "Нужна цифра", "Нужен спецсимвол"])
#
# Подсказка: re.search(r"[A-ZА-Я]", password)

# Ваш код здесь:


# ============================================================
# Задание 4: Извлечение дат
# ============================================================
# Напишите функцию find_dates(text), которая находит даты
# в форматах: ДД.ММ.ГГГГ, ДД/ММ/ГГГГ, ГГГГ-ММ-ДД.
# Верните список кортежей (день, месяц, год).
#
# Ожидаемый результат:
#   text = "Родился 15.03.1990, паспорт от 2020-01-20, виза до 25/12/2025"
#   print(find_dates(text))
#   → [("15", "03", "1990"), ("20", "01", "2020"), ("25", "12", "2025")]
#
# Подсказка:
#   r"(\d{2})[./](\d{2})[./](\d{4})"   — ДД.ММ.ГГГГ
#   r"(\d{4})-(\d{2})-(\d{2})"          — ГГГГ-ММ-ДД

# Ваш код здесь:


# ============================================================
# Задание 5: Замена и очистка текста
# ============================================================
# Напишите функции:
#   censor(text, words) → заменяет слова из списка на "***"
#   clean_html(html) → удаляет все HTML-теги
#   normalize_spaces(text) → заменяет множественные пробелы одним
#
# Ожидаемый результат:
#   print(censor("Это плохое и ужасное решение", ["плохое", "ужасное"]))
#   → "Это *** и *** решение"
#
#   print(clean_html("<p>Привет, <b>мир</b>!</p>"))
#   → "Привет, мир!"
#
#   print(normalize_spaces("Привет    мир   !"))
#   → "Привет мир !"
#
# Подсказка:
#   re.sub(pattern, replacement, text)
#   re.sub(r"<[^>]+>", "", html)
#   re.sub(r"\s+", " ", text).strip()

# Ваш код здесь:


# ============================================================
# Задание 6: Парсинг URL
# ============================================================
# Напишите функцию parse_url(url), которая извлекает
# компоненты URL: протокол, домен, порт, путь, параметры.
#
# Ожидаемый результат:
#   result = parse_url("https://example.com:8080/path/page?id=5&lang=ru")
#   print(result)
#   → {"protocol": "https", "domain": "example.com",
#      "port": "8080", "path": "/path/page",
#      "params": {"id": "5", "lang": "ru"}}
#
# Подсказка:
#   r"(https?)://([^/:]+):?(\d+)?(/[^?]*)?\??(.*)"
#   params = dict(p.split("=") for p in params_str.split("&"))

# Ваш код здесь:


# ============================================================
# Задание 7: Парсинг лог-файла
# ============================================================
# Дана строка лога. Извлеките дату, уровень, сообщение.
# Формат: "[2025-05-07 14:30:00] ERROR: Файл не найден"
#
# Ожидаемый результат:
#   logs = """
#   [2025-05-07 14:30:00] ERROR: Файл не найден
#   [2025-05-07 14:30:01] INFO: Сервер запущен
#   [2025-05-07 14:30:02] WARNING: Мало памяти
#   """
#   parsed = parse_logs(logs)
#   print(parsed[0])
#   → {"date": "2025-05-07 14:30:00", "level": "ERROR",
#      "message": "Файл не найден"}
#
#   errors = [l for l in parsed if l["level"] == "ERROR"]
#   print(len(errors))  → 1
#
# Подсказка: r"\[(.+?)\]\s+(\w+):\s+(.+)"

# Ваш код здесь:


# ============================================================
# Задание 8: Группы и обратные ссылки
# ============================================================
# 1. Найдите повторяющиеся слова в тексте ("the the", "is is")
# 2. Поменяйте местами имя и фамилию ("Иванов Иван" → "Иван Иванов")
#
# Ожидаемый результат:
#   text = "Это это пример с с повторами"
#   print(find_duplicates(text))
#   → ["Это это", "с с"]
#
#   name = "Иванов Иван Петрович"
#   print(swap_name(name))
#   → "Иван Иванов Петрович"  (первые два слова меняются)
#
# Подсказка:
#   r"\b(\w+)\s+\1\b"   — обратная ссылка \1
#   re.sub(r"(\w+)\s+(\w+)", r"\2 \1", name, count=1)

# Ваш код здесь:


# ============================================================
# Задание 9: Токенизатор выражений
# ============================================================
# Напишите функцию tokenize(expression), которая разбивает
# математическое выражение на токены (числа, операторы, скобки).
#
# Ожидаемый результат:
#   tokens = tokenize("3 + 42 * (10 - 5) / 2.5")
#   print(tokens)
#   → [("NUM", "3"), ("OP", "+"), ("NUM", "42"), ("OP", "*"),
#      ("LPAREN", "("), ("NUM", "10"), ("OP", "-"), ("NUM", "5"),
#      ("RPAREN", ")"), ("OP", "/"), ("NUM", "2.5")]
#
# Подсказка:
#   patterns = [
#       (r"\d+\.?\d*", "NUM"),
#       (r"[+\-*/]", "OP"),
#       (r"\(", "LPAREN"),
#       (r"\)", "RPAREN"),
#   ]
#   re.finditer(combined_pattern, expression)

# Ваш код здесь:


# ============================================================
# Задание 10: Валидатор форм
# ============================================================
# Создайте класс FormValidator с методами:
#   validate_email(email) → bool
#   validate_phone(phone) → bool
#   validate_date(date) → bool (ДД.ММ.ГГГГ)
#   validate_ip(ip) → bool (IPv4)
#   validate_all(data_dict) → словарь {поле: bool}
#
# Ожидаемый результат:
#   v = FormValidator()
#   print(v.validate_email("user@mail.ru"))    → True
#   print(v.validate_email("invalid"))         → False
#   print(v.validate_ip("192.168.1.1"))        → True
#   print(v.validate_ip("999.1.1.1"))          → False
#
#   data = {"email": "a@b.com", "phone": "+79991234567",
#           "date": "32.13.2025", "ip": "10.0.0.1"}
#   print(v.validate_all(data))
#   → {"email": True, "phone": True, "date": False, "ip": True}
#
# Подсказка: IPv4: r"^((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}..."

# Ваш код здесь:
