"""
10 — Live Coding: Практические упражнения

⏱️ Засеките время! Решайте каждую задачу за 10-15 минут.
Запустите для проверки: python exercises.py
"""


# ============================================================
# Упражнение 1: FizzBuzz
# ============================================================
# Верните список строк от 1 до n:
# - Делится на 3 → "Fizz"
# - Делится на 5 → "Buzz"
# - Делится на 3 и 5 → "FizzBuzz"
# - Иначе → str(число)

def fizzbuzz(n):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 2: Two Sum
# ============================================================
# Найдите два индекса, сумма элементов по которым равна target.
# Гарантировано одно решение. O(n) по времени!

def two_sum(nums, target):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 3: Valid Parentheses
# ============================================================
# Проверьте корректность скобочной последовательности.
# Скобки: (), [], {}

def is_valid_parens(s):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 4: Group Anagrams
# ============================================================
# Сгруппируйте строки-анаграммы в списки.

def group_anagrams(strs):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 5: Maximum Subarray (Kadane's Algorithm)
# ============================================================
# Найдите максимальную сумму непрерывного подмассива.

def max_subarray(nums):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 6: Merge Intervals
# ============================================================
# Объедините пересекающиеся интервалы.
# Вход: [[1,3],[2,6],[8,10],[15,18]]
# Выход: [[1,6],[8,10],[15,18]]

def merge_intervals(intervals):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 7: Flatten Dictionary
# ============================================================
# Разверните вложенный словарь в плоский.
# {"a": {"b": 1}} → {"a.b": 1}

def flatten_dict(d, prefix=""):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 8: Find Duplicates
# ============================================================
# Найдите все элементы, которые встречаются более одного раза.

def find_duplicates(nums):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 9: Reverse Words
# ============================================================
# Разверните порядок слов в строке.
# "  hello world  " → "world hello"
# Удалите лишние пробелы.

def reverse_words(s):
    # Ваш код здесь
    pass


# ============================================================
# Упражнение 10: Spiral Matrix
# ============================================================
# Выведите элементы матрицы в спиральном порядке.
# [[1,2,3],[4,5,6],[7,8,9]] → [1,2,3,6,9,8,7,4,5]

def spiral_order(matrix):
    # Ваш код здесь
    pass


# ============================================================
# Тесты
# ============================================================
if __name__ == "__main__":
    print("=" * 50)
    print("Тестирование упражнений 10_live_coding_patterns")
    print("=" * 50)

    # Тест 1
    print("\n--- Упражнение 1: FizzBuzz ---")
    result = fizzbuzz(15)
    assert result[2] == "Fizz"      # 3
    assert result[4] == "Buzz"      # 5
    assert result[14] == "FizzBuzz" # 15
    assert result[0] == "1"
    assert len(result) == 15
    print("✅ Пройдено!")

    # Тест 2
    print("\n--- Упражнение 2: Two Sum ---")
    assert two_sum([2, 7, 11, 15], 9) == [0, 1]
    assert two_sum([3, 2, 4], 6) == [1, 2]
    assert two_sum([3, 3], 6) == [0, 1]
    print("✅ Пройдено!")

    # Тест 3
    print("\n--- Упражнение 3: Valid Parentheses ---")
    assert is_valid_parens("()[]{}") is True
    assert is_valid_parens("(]") is False
    assert is_valid_parens("([)]") is False
    assert is_valid_parens("{[]}") is True
    assert is_valid_parens("") is True
    assert is_valid_parens(")") is False
    print("✅ Пройдено!")

    # Тест 4
    print("\n--- Упражнение 4: Group Anagrams ---")
    result = group_anagrams(["eat", "tea", "tan", "ate", "nat", "bat"])
    result_sorted = [sorted(g) for g in result]
    assert sorted(result_sorted) == sorted([["ate", "eat", "tea"], ["nat", "tan"], ["bat"]])
    print("✅ Пройдено!")

    # Тест 5
    print("\n--- Упражнение 5: Max Subarray ---")
    assert max_subarray([-2, 1, -3, 4, -1, 2, 1, -5, 4]) == 6
    assert max_subarray([1]) == 1
    assert max_subarray([-1, -2, -3]) == -1
    assert max_subarray([5, 4, -1, 7, 8]) == 23
    print("✅ Пройдено!")

    # Тест 6
    print("\n--- Упражнение 6: Merge Intervals ---")
    assert merge_intervals([[1, 3], [2, 6], [8, 10], [15, 18]]) == [[1, 6], [8, 10], [15, 18]]
    assert merge_intervals([[1, 4], [4, 5]]) == [[1, 5]]
    assert merge_intervals([]) == []
    print("✅ Пройдено!")

    # Тест 7
    print("\n--- Упражнение 7: Flatten Dict ---")
    assert flatten_dict({"a": 1, "b": {"c": 2, "d": {"e": 3}}}) == {"a": 1, "b.c": 2, "b.d.e": 3}
    assert flatten_dict({}) == {}
    assert flatten_dict({"x": 42}) == {"x": 42}
    print("✅ Пройдено!")

    # Тест 8
    print("\n--- Упражнение 8: Find Duplicates ---")
    assert sorted(find_duplicates([1, 2, 3, 1, 2])) == [1, 2]
    assert find_duplicates([1, 2, 3]) == []
    print("✅ Пройдено!")

    # Тест 9
    print("\n--- Упражнение 9: Reverse Words ---")
    assert reverse_words("  hello world  ") == "world hello"
    assert reverse_words("a good   example") == "example good a"
    print("✅ Пройдено!")

    # Тест 10
    print("\n--- Упражнение 10: Spiral Matrix ---")
    assert spiral_order([[1, 2, 3], [4, 5, 6], [7, 8, 9]]) == [1, 2, 3, 6, 9, 8, 7, 4, 5]
    assert spiral_order([[1]]) == [1]
    print("✅ Пройдено!")

    print("\n" + "=" * 50)
    print("🎉 Все упражнения выполнены верно!")
    print("=" * 50)
